# https://github.com/CheMax-sudo/python_homework/blob/624fd1447a786a479c611d86a8ed2d9f3aa1deca/work5.py

# Задание 1. Поиск элемента
# Пользователь вводит искомый ключ. Если он хочет, то может ввести
# максимальную глубину — уровень, до которого будет просматриваться
# структура.
# Напишите функцию, которая находит заданный пользователем ключ в словаре
# и выдаёт значение этого ключа на экран. По умолчанию уровень не задан. В
# качестве примера можно использовать такой словарь:

site = {'html': {'head': {'title': 'Мой сайт'},
'body': {'h2': 'Здесь будет мой заголовок',
'div': 'Тут, наверное, какой-то блок',
'p': 'А вот здесь новый абзац'}}}

# Пример 1
# Введите искомый ключ: head
# Хотите ввести максимальную глубину? Y/N: n
# Значение ключа: {'title': 'Мой сайт'}
# Пример 2
# Введите искомый ключ: head
# Хотите ввести максимальную глубину? Y/N: y
# Введите максимальную глубину: 1
# Значение ключа: None


def find_dkey(dict_x, find_key, max_depth=None, depth = 0):
    for key, value in dict_x.items():
        if find_key in dict_x:
            value = dict_x[find_key]
            return f"{value} / глубина : {depth}"
        else:
            if isinstance(value, dict):             
                result = find_dkey(value, find_key, max_depth, depth + 1) #  Рекурсия. 
                if result is not None:  #Базовый случай. Выход из рекурсии.         
                    return result
                if depth >= max_depth:
                    return "Превышена максимальная глубина поиска"
                 
print(find_dkey(site, 'p', 3))


# Задача 2. Глубокое копирование
# Вы сделали для заказчика структуру сайта по продаже телефонов:
site = {'html': {'head': {'title': 'Куплю/продам {smartfone} недорого'},
                 'body': {'h2': 'У нас самая низкая цена на {smartfone}}', 'div': 'Купить', 'p': 'Продать'}}
       }
# Заказчик рассказал своим коллегам на рынке, и они захотели такой же сайт для
# своих товаров. Вы посчитали, что это лёгкая задача, и быстро принялись за
# работу.
# Напишите программу, которая запрашивает у клиента количество сайтов, затем
# названия продуктов, а после каждого запроса выводит на экран активные
# сайты.

# Условия:
# ● учтите, что функция должна уметь работать с разными сайтами (иначе
# вам придётся переделывать программу под каждого заказчика заново);
# ● вы должны получить список, хранящий сайты для разных продуктов (а
# значит, для каждого продукта нужно будет первым делом выполнить
# глубокое копирование сайта).
# Пример вывода
# Сколько сайтов: 2
# Введите название продукта для нового сайта: iPhone
# Сайт для iPhone:

# site = {
# 'html': {
# 'head': {
# 'title': 'Куплю/продам iPhone недорого'
# },
# 'body': {
# 'h2': 'У нас самая низкая цена на iPhone',
# 'div': 'Купить',
# 'p': 'Продать'
# }
# }
# }
# # Введите название продукта для нового сайта: Samsung
# # Сайт для iPhone:
# site = {
# 'html': {
# 'head': {
# 'title': 'Куплю/продам iPhone недорого'
# },
# 'body': {
# 'h2': 'У нас самая низкая цена на iPhone',
# 'div': 'Купить',
# 'p': 'Продать'
# }
# }
# }
# # Сайт для Samsung:
# site = {
# 'html': {
# 'head': {
# 'title': 'Куплю/продам Samsung недорого'
# },
# 'body': {
# 'h2': 'У нас самая низкая цена на Samsung',
# 'div': 'Купить',
# 'p': 'Продать'
# }
# }
# }
# Обратите внимание, что на первой итерации выводится только один сайт (для
# iPhone), а на второй итерации — оба сайта (и для iPhone и для Samsung).
# Чтобы это реализовать, нужно сохранять сайты в списке и каждый раз печатать
# все его элементы.

import pprint

site = {'html': {'head': {'title': 'Куплю/продам {product} недорого'},
                 'body': {'h2': 'У нас самая низкая цена на {product}}', 'div': 'Купить', 'p': 'Продать'}}}
        
n = int(input("Введите кол-во сайтов: "))

site_new = []

for i in range(n):
    
    product = input("Введите название продукта для нового сайта: ")
    for key, value in site.items():
        site['html']['head']['title'] = f'Куплю/продам {product} недорого'
        site['html']['body']['h2'] = f'У нас самая низкая цена на {product}'
        site_new.append(site)
      
pprint.pprint(site_new)

# Задача 3. Продвинутая функция sum
# Как вы знаете, в Python есть полезная функция sum, которая умеет находить
# сумму элементов списков. Иногда базовых возможностей функций не хватает
# для работы и приходится их усовершенствовать.
# Напишите свою функцию sum, которая должна быть более гибкой, чем
# стандартная. Она должна уметь складывать числа:
# ● из списка списков,
# ● набора параметров.
# Основной код оставьте пустым или закомментированным (используйте его
# только для тестирования).
# Примеры вызовов функции
# sum([[1, 2, [3]], [1], 3])
# Ответ в консоли: 10
# sum(1, 2, 3, 4, 5)
# Ответ в консоли: 15

lst = [5, 5, 6, 8, [3, 2, 1]]

def multi_sum(*args):
    def sum_rec(numbers):
        total_sum = 0
        for item in numbers:
            if isinstance(item, int):
                total_sum += item
            elif isinstance(item, list):
                total_sum += sum_rec(item)
        return total_sum

    if len(args) == 1 and isinstance(args[0], list):
        numbers = args[0]
    else:
        numbers = args
    return sum_rec(numbers)
         
    
# Задача 4. Список списков
# Дан список:
nice_list = [1, 3, [3, 4], [[5, 6, 7], [8, 9, 10]], [[11, 12, 13], [14, 15], [16, 17, 18]]]
# Напишите рекурсивную функцию, которая раскрывает все вложенные списки,
# то есть оставляет только внешний список.
# Ответ: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18]
# Функция должна получать список и возвращать его раскрытую версию (не
# нужно добавлять элементы в список, записанный в глобальную переменную,
# созданную снаружи функции). 


def list_merge(lst, res=[]):
    for el in lst:
        if isinstance(el, list):
            list_merge(el)      
        else:
            res.append(el)
    return res

print(list_merge(nice_list))

